			<div id="content">
				<h1>Daten, Information, Wissen</h1>
				<p>Computer bearbeiten Daten, Menschen interpretieren und haben Wissen.</p>
				<blockquote>Wir schlie&szlig;en uns Michael Polanyi an, wenn wir sagen, da&szlig; wir mehr wissen, als
				wir mit Worten ausdr&uuml;cken k&ouml;nnen. [...] Was kann man Computern mitteilen? Wir haben unter
				&raquo;mitteilen&laquo; die Eingabe eines effektiven Verfahrens verstanden. Und die Frage, die uns im
				Augenblick besch&auml;ftigt, lautet: Kann alles, was wir tun wollen, im Sinne eines effektiven Verfahrens
				beschrieben werden? [...] Wir werden sehen, [...] da&szlig; die Frage, was wir einem Computer leisten lassen
				k&ouml;nnen, im letzten Grunde die Frage ist, was wir einem Computer an Wissen beibringen k&ouml;nnen.<sup><a href="#sources">[1]</a></sup></blockquote>
				<p>Programmierung ist das Entwickeln einer vorher festgehaltenen Idee. Das Programmieren ist eine geistige 
				T&auml;tigkeit - die Maschinisierung von Kopfarbeit: Vom Computer ausgef&uuml;hrte Berechnungen haben immer 
				einen gedanklichen Ursprung/Hintergrund - unsere Formulierungen - und sind somit geistiger Art.</p>
				<p>Der Computer ist eine Zustandsmaschine, welche lediglich berechnen, nicht aber im menschlichen Sinne interpretieren
				kann. Der Rechner nimmt Befehle entgegen und f&uuml;hrt diese aus - ohne nach dem Sinn zu fragen oder sie zu verstehen.
				Beispielsweise w&uuml;rde es f&uuml;r uns Menschen keinen Sinn machen, dem Coputer den Befehl zu geben, eine schwarze Linie
				auf einen schwarzen Hintergrund zu zeichnen - f&uuml;r uns &auml;ndert sich das Bild dadurch nicht.</p>
				<blockquote>[...] nothing apperas to happen in the visual output. But be aware that something has 
				indeed happened from the viewpoint of the computer. The computer has labored to create a line, just 
				as if the line were visible. The computer does not know when it has done something completely useless,
				such as drawing a black line on black paper. Only you do.<sup><a href="#sources">[2]</a></sup></blockquote>
				<h2>Heideggers &bdquo;Sein und Zeit&rdquo;</h2>
				<p>Das 1927 erschienene Werk &bdquo;Sein und Zeit&rdquo; wurde von Martin Heidegger (1889-1976) geschrieben 
				und gilt heute &bdquo;als eines der einflussreichsten Werke der Philosophie im 20. Jahrhundert&rdquo;<sup><a href="#sources">[3]</a></sup>.</p>
				<p>Im Mittelpunkt des Werkes steht &bdquo;die Ausarbeitung der Frage nach dem Sinn von Sein&rdquo;<sup><a href="#sources">[4]</a></sup> - jene 
				Frage also, welche die Philosophie schon seit jeher besch&auml;ftigt. Heideggers Ann&auml;herung unterscheidet sich allerdings schon durch die
				Frage nach dem Ursprung der Seiensfrage: Wir Menschen unterscheiden uns von allem anderen Seiendem durch die Reflexion unserer Existenz, weshalb er
				unsere Seinsform als &bdquo;Dasein&rdquo; beschreibt.</p>
				<p>&bdquo;Jeder Mensch glaubt ungef&auml;hr zu wissen, was &bdquo;Sein&rdquo; bedeutet, und sagt &bdquo;ich bin&rdquo; und &bdquo;das da ist&rdquo;. 
				Das Dasein kann dar&uuml;ber staunen, dass es &bdquo;&uuml;berhaupt etwas gibt und nicht vielmehr nichts.&rdquo; Es ist geworfen in das &bdquo;Da-sein&rdquo; und
				muss sich zu seinem Sein und zum Sein als Ganzem verhalten, ob es will oder nicht.&rdquo;<sup><a href="#sources">[3]</a></sup></p>
				<p>Das Werk sollte eigentlich aus zwei B&auml;nden, mit jeweils mehreren Teilen bestehen, Heidegger brach die Arbeiten allerdings nach dem zweiten 
				Teil des ersten Bands ab, um sich der Antwort nach der Seinsfrage auf anderem Wege zu n&auml;hern.<sup><a href="#sources">[3]</a></sup></p>
				<h3>Der Einflu&szlig; auf eine tiefgreifende Kritik an der Informatik</h3>
				<p>Das Buch &bdquo;Understanding Computers and Cognition. A New Foundation for Design.&rdquo; von Terry Winograd und Fernando Flores, 
				welches 1986 erschien, befasst sich unter anderem mit der k&uuml;nstlichen Intelligenz, wobei die beiden Autoren auf vielen der von 
				Heidegger aufgestellten Thesen aufbauen.</p>
				<p>Die Kritik bezieht sich auf den Begriff der &bdquo;k&uuml;nstlichen Intelligenz&rdquo;, welche in diesem Sinne keine ist, da ein Computer 
				nicht &uuml;ber ein Dasein verf&uuml;gt. Ein Rechner ist sich nicht seiner selbst bewusst, ihm fehlen Hintergrund- und Vorverst&auml;ndnis bei 
				der Probleml&ouml;sung, so dass er nur formalisiert agieren kann.</p>
			</div>
			<ul class="go">
				<li>&laquo; <?= link_to("bild_text_maschine_medium"); ?> <span class="space">|</span> </li>
				<li><a href="<?= url_for("start"); ?>#contents">Inhaltsverzeichnis</a> <span class="space">|</span> </li>
				<li><?= link_to("abstraktion"); ?> &raquo;</li>
			</ul>
			<div id="sources">
				<h3>Quellen</h3>
				<ol>
					<li><a href="<?= url_for("literatur"); ?>#weiz78">[Weiz78, 105]</a></li>
					<li><a href="<?= url_for("literatur"); ?>#maed99">[Maed99]</a></li>
					<li>Wikipedia: Sein und Zeit. <a href="http://de.wikipedia.org/wiki/Sein_und_Zeit">http://de.wikipedia.org/wiki/Sein_und_Zeit</a>. Aufgerufen am 15.01.2007.</li>
					<li><a href="http://www.capurro.de/heidegger.htm">http://www.capurro.de/heidegger.htm</a>. Aufgerufen am 15.01.2007.</li>
				</ol>
			</div>